using System;
using System.Collections.Generic;

namespace HomeWork4._5
{
    // Суханов
    // а) Реализовать библиотеку с классом для работы с двумерным массивом.
    // Реализовать конструктор, заполняющий массив случайными числами.
    // Создать методы, которые возвращают сумму всех элементов массива, сумму всех элементов массива больше заданного,
    // свойство, возвращающее минимальный элемент массива,
    // свойство, возвращающее максимальный элемент массива,
    // метод, возвращающий номер максимального элемента массива (через параметры, используя модификатор ref или out).
    // * б) Добавить конструктор и методы, которые загружают данные из файла и записывают данные в файл.
    // ** в) Обработать возможные исключительные ситуации при работе с файлами.
    class Program
    {
        static void Main(string[] args)
        {
            // Не знаю, как реализовать библиотеку с классом для работы с массивом. Пробовал создать библиотеку с классом для одномерного массива,
            // Добавил в зависимость к одному проекту, ничего не работает. Не получилось реализовать в задании 3. Здесь уже и не дошёл до решения. 
            
        }
    }
}
